"""
1) for ციკლის მეშვეობით დაპრინტეთ
რიცხვები 1-დან 6-ის ჩათვლით
"""

for i in range(1, 6 + 1):
    print(i)


"""
2) for ციკლის მეშვეობით დაპრინტეთ რიცხვები 6-დან 0-მდე
"""

for i in range(6, 0, -1):
    print(i)


"""
3) for ციკლის მეშვეობით დაპრინტეთ
ლუწი რიცხვები 1-დან 20-ის ჩათვლით
"""

for i in range(2, 21, 2):
    print(i)


"""
4) for ციკლის მეშვეობით დაპრინტეთ
კენტი რიცხვები 5-დან 15-ის ჩათვლით
"""

for i in range(5, 16, 2):
    print(i)


"""
5) for ციკლის მეშვეობით დაპრინტეთ 1-დან 5-ის ჩათვლით რიცხვების ჯამი
"""

sum = 0

for i in range(1, 6):
    sum = sum + i
print(sum)


"""
6) for ციკლის მეშვეობით დაპრინტეთ 5-დან 10-ის ჩათვლით რიცხვების საშუალო
"""

sum = 0
count = 0

for i in range(5, 8):
    count = count + 1
    sum = sum + i

average = sum / count

print(average)
